app/Views/admin/dashboardNew.php

SELECT COUNT(*) AS `numrows`
FROM `tb_data`
---
        <canvas id="donutChart" style="min-height: 500px; height: 500px; max-height: 500px; max-width: 100%;"></canvas>
        <?php
        $db = \Config\Database::connect();
        $totalresponden = $db->table('tb_data')->countAllResults();