app/Models/ModelSurvey.php

INSERT INTO `tb_data` (`layanan`, `prosedur`, `kesesuaian`, `kejelasan`, `kemampuan`, `kecepatan`, `kesopanan`, `kewajaran`, `kepastian_biaya`, `kepastian_jadwal`, `kenyamanan`, `time`) VALUES ('Kerumahtanggaan', '4', '4', '4', '4', '4', '4', '4', '4', '4', '4', '2023-07-04')
---
    function simpan($data)
    {
        return $this->table('tb_data')->insert($data);

SELECT *
FROM `tb_data`
ORDER BY `datetime` DESC
---
    function tampildata()
    {
        return $this->table('tb_data')->orderBy('datetime DESC')->get();